package com.example.lab03.data

object ItemsData {
    val itemList = listOf(
        Item(1, "Велика Китайська стіна",
            "Велика Китайська стіна — це одна з найбільших архітектурних споруд у світі, що розтягується на понад 21 000 км через північний Китай. Створена для захисту від набігів кочових племен, ця стіна є символом могутності китайської цивілізації.",
            "great_wall"),

        Item(2, "Мачу-Пікчу",
            "Мачу-Пікчу — древнє місто інків, що розташоване на високих гірських схилах Перу. Це один з найбільш загадкових археологічних комплексів, який зберігся в дуже хорошому стані, ставши символом імперії інків.",
            "machu_picchu"),

        Item(3, "Чичен-Іца",
            "Чичен-Іца — одна з найбільших археологічних пам'яток майя в Мексиці. Це місто з великим пірамідальним храмом та численними будівлями, яке було культурним і політичним центром майя.",
            "chichen_itza"),

        Item(4, "Колізей",
            "Колізей — амфітеатр у Римі, найбільша споруда античного Риму, яка використовувалась для гладіаторських боїв, театралізованих битв та інших видовищних подій.",
            "colosseum"),

        Item(5, "Тадж-Махал",
            "Тадж-Махал — мавзолей, побудований імператором Шахом Джаханом на честь своєї дружини Мумтаз Махал. Це одне з найбільш величних архітектурних досягнень Індії.",
            "taj_mahal"),

        Item(6, "Статуя Христа-Спасителя",
            "Статуя Христа-Спасителя — величезна статуя Ісуса Христа в Ріо-де-Жанейро, Бразилія. Вона є символом християнства і однією з найбільш впізнаваних пам'яток світу.",
            "christ_the_redeemer"),

        Item(7, "Піраміди Гізи",
            "Піраміди Гізи — одні з семи чудес стародавнього світу, що залишилися до нашого часу. Це величні монументи, що були побудовані як гробниці для фараонів Стародавнього Єгипту.",
            "pyramids_of_giza")
    )
}

data class Item(val id: Int, val title: String, val description: String, val image: String)
